IDEA StatiCa Open Model
ReinfBarByTwoPoints.Position1 Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Offset between first master point and first point of bar
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public Vector3D Position1 { get; set; }
Public Property Position1 As Vector3D
	Get
	Set
public:
property Vector3D^ Position1 {
	Vector3D^ get ();
	void set (Vector3D^ value);
}
Property Value
Type: Vector3D
See Also
Reference
ReinfBarByTwoPoints Class
IdeaRS.OpenModel.Detail Namespace